import React from 'react';
import LineChart from './charts/LineChart';
import './App.css';


/*import React from 'react';
import SimpleHeatMapApex from './heatmap/SimpleHeatMapApex'; // HeatMap bileşenini doğru dosya yoluyla import et

function App() {
  return (
    <div>
      <h1>Simple HeatMap Example</h1>
      <SimpleHeatMapApex />  {/* Isı haritası bileşenini çağırıyoruz }
    /*</div>
  );
}

export default App;
*/







function generateRandomColors(length) {
  const colors = [];
  for (let i = 0; i < length; i++) {
    const color = `rgba(${Math.floor(Math.random() * 256)}, ${Math.floor(Math.random() * 256)}, ${Math.floor(Math.random() * 256)}, 0.5)`;

    colors.push(color);
  }
  return colors;
}

function convertDataToChartJSFormat(data) {
  
  const resultArray = [];
  const keys = Object.keys(data);

  for (let i = 0; i < keys.length; i++) {
    const item = keys[i];
    const colorsForNonEvent = generateRandomColors(data[item].non_event.length);
    const colorsForEvent = generateRandomColors(data[item].event.length);

   
    const formattedData = {
      title: data[item].title,
      labels: data[item].bin, // X ekseni etiketleri
      datasets: [
        {
          label: 'WoE', // Çizgi grafiği için etiket
          data: data[item].woe, // Weight of Evidence verileri
          borderColor: ' blue', // Çizgi rengi
          borderWidth: 4,
          backgroundColor: 'rgb(230, 230, 230)', // Arka plan rengi
          type: 'line', // Çizgi grafiği türü
          yAxisID: 'scale2' // Y ekseni ID'si
        },
        {
          label: 'Event', // Bar grafiği için etiket
          data: data[item].event, // Event verileri
          borderColor: colorsForEvent, // Çizgi rengi
          backgroundColor: colorsForEvent, // Arka plan rengi (Yarı saydam)
          type: 'bar', // Bar grafiği türü
          stack: 'combined', // Yığın adı
          yAxisID: 'scale1' // Y ekseni ID'si
        },
        
        {
          label: 'Non Event', // Bar grafiği için etiket
          data: data[item].non_event, // Non-event verileri
          borderColor: colorsForNonEvent, // Çizgi rengi
          backgroundColor: colorsForNonEvent, // Arka plan rengi (Yarı saydam)
          type: 'bar', // Bar grafiği türü
          stack: 'combined', // Yığın adı
          yAxisID: 'scale1' // Y ekseni ID'si
        },
       
      ]
    };
  
  
    resultArray.push(formattedData);
  }

  return resultArray; 
}

function App() {
  const rawData = {
    item1: {
      title : "Customer Age",
      bin: ["(-inf, 17.10)",
            "[17.10, 19.10)",
            "[19.10, 28.70)",
            "[28.70, 37.70)",
            "[37.70, 43.10)",
            "[43.10, 45.10)",
            "[45.10, 49.50)",
            "[49.50, inf)",
            "Missing"],
      non_event: [ 1199,
        1357,
        6414,
        6624,
        4316,
        1462,
        1777,
        2821,
        251],
      event: [ 998,
        622,
        2912,
        2985,
        1876,
        558,
        271,
        382,
        105],
      woe: [ -0.7119862282988232,
        -0.11538453991918385,
        -0.10583313607834988,
        -0.09837643677648045,
        -0.06228891020301808,
        0.06772557091353937,
        0.985086900260077,
        1.1039499953805478,
        -0.02398351804061294]
    },
    item2: {
      title : "Yearly Incomes",
      bin: ["(-inf, 10230.60)",
            "[10230.60, 21057.00)",
            "[21057.00, 83709.80)",
            "[83709.80, inf)"],
      non_event: [ 966,
        5437,
        13864,
        5954],
      event: [ 1291,
        3349,
        5251,
        818],
      woe: [ -1.185484663648998,
        -0.4109104626631575,
        0.07540091074270938,
        1.0894800979581012]
    },
    item3: {
      title : "Monthly Salary",
      bin: [ "(-inf, 883.84)",
        "[883.84, 1486.81)",
        "[1486.81, 1852.88)",
        "[1852.88, 5352.79)",
        "[5352.79, 7081.75)",
        "[7081.75, inf)"],
      non_event: [911,
        2796,
        1969,
        13459,
        2951,
        4135],
      event: [942,
        1803,
        1126,
        5277,
        1023,
        538],
      woe: [ -0.928938484331278,
        -0.4567382268644899,
        -0.3366218370753836,
        0.04081416581317432,
        0.16392850197643927,
        1.1439079402811339]
    },
    item4: {
      title : "Number of Bank Accounts",
      bin: ["(-inf, 3.90)",
            "[3.90, 4.10)",
            "[4.10, 5.90)",
            "[5.90, 6.70)",
            "[6.70, 8.10)",
            "[8.10, inf)"],
      non_event: [ 7899,
        3886,
        3851,
        3068,
        5971,
        1546],
      event: [ 1429,
        712,
        718,
        1753,
        3553,
        2544],
      woe: [ 0.814285163219678,
        0.8015816115105362,
        0.7841424577518111,
        -0.3357788294489611,
        -0.37635400648890815,
        -1.3935428023275191]
    },
    item5: {
      title : "Number of Credit Card",
      bin: [ "(-inf, 3.10)",
        "[3.10, 4.90)",
        "[4.90, 5.70)",
        "[5.70, 6.10)",
        "[6.10, 7.10)",
        "[7.10, inf)"],
      non_event: [ 5833,
        4616,
        5071,
        4338,
        4247,
        2116],
      event: [  634,
        724,
        1948,
        1851,
        1926,
        3626],
      woe: [  1.3237616653015385,
        0.9570163087873457,
        0.061258724577665236,
        -0.04378872820155133,
        -0.1047085690596733,
        -1.4340787053514799]
    },
    item6: {
      title : "Interest Rate",
      bin: ["(-inf, 14.90)",
            "[14.90, 17.30)",
            "[17.30, 20.50)",
            "[20.50, inf)"],
      non_event: [ 17423,
        2951,
        2875,
        2972],
      event: [2306,
        1350,
        1380,
        5673],
      woe: [ 1.1268006435790276,
        -0.1134366035044092,
        -0.16150693193467314,
        -1.5419590585037912]
    },
    item7: {
      title : "Number of Loan",
      bin: ["(-inf, 1.90)",
            "[1.90, 4.10)",
            "[4.10, 6.30)",
            "[6.30, 7.30)",
            "[7.30, inf)"],
      non_event: [ 8171,
        12889,
        2720,
        1262,
        1179],
      event: [  1237,
        3726,
        2909,
        1426,
        1411],
      woe: [ 0.9924260999773461,
        0.3455628552283724,
        -0.962653606220032,
        -1.017651664887956,
        -1.0751081583303164]
    },
    item8: {
      title : " Delay From Due Date",
      bin: ["(-inf, 4.50)",
            "[4.50, 9.30)",
            "[9.30, 12.20)",
            "[12.20, 14.20)",
            "[14.20, 16.20)",
            "[16.20, 19.10)",
            "[19.10, 30.10)",
            "[30.10, 37.30)",
            "[37.30, inf)"],
      non_event: [2743,
        5085,
        3013,
        2119,
        1719,
        2058,
        6921,
        892,
        1671],
      event: [  214,
        762,
        491,
        369,
        568,
        863,
        3221,
        1192,
        3029],
      woe: [ 1.6553553689008784,
        1.0026276457811405,
        0.9187713043209073,
        0.8524268072128985,
        0.21190047964682435,
        -0.026400881704306656,
        -0.13060770950420886,
        -1.185397822060159,
        -1.490286389446717]
    },
    item9: {
      title : "Number of Delayed Payment",
      bin: [ "(-inf, 7.10)",
        "[7.10, 13.70)",
        "[13.70, 14.90)",
        "[14.90, 15.90)",
        "[15.90, 16.90)",
        "[16.90, 17.10)",
        "[17.10, 19.10)",
        "[19.10, 20.10)",
        "[20.10, inf)"],
      non_event: [ 5093,
        8684,
        3078,
        1316,
        1334,
        1278,
        2533,
        1177,
        1728],
      event: [ 919,
        2173,
        1120,
        595,
        642,
        681,
        1463,
        740,
        2376],
      woe: [0.8168600975140442,
        0.4898974437268794,
        0.11547524309481083,
        -0.10168540067524068,
        -0.16412718422926542,
        -0.26598677822690575,
        -0.34656085803332237,
        -0.43140218595281216,
        -1.213929838133408]
    },
    item10: {
      title : "Changed Credit Mix",
      bin: ["(-inf, 1.60)",
            "[1.60, 11.98)",
            "[11.98, 15.15)",
            "[15.15, 20.02)",
            "[20.02, inf)"],
      non_event: [ 1899,
        16422,
        2539,
        3945,
        1416],
      event: [ 658,
        6135,
        1050,
        1951,
        915],
      woe: [0.16440167247209503,
        0.08913571410884868,
        -0.01249596846176404,
        -0.19136921435801002,
        -0.4588088980367298]
    },
    item11: {
      title : "Number of Credit Inquiries",
      bin: [ "(-inf, 0.90)",
        "[0.90, 3.30)",
        "[3.30, 4.30)",
        "[4.30, 5.50)",
        "[5.50, 6.90)",
        "[6.90, 7.10)",
        "[7.10, 8.50)",
        "[8.50, 10.50)",
        "[10.50, inf)"],
      non_event: [  2651,
        8605,
        3853,
        1606,
        2478,
        1868,
        1826,
        1546,
        1788],
      event: [ 292,
        1118,
        501,
        268,
        1239,
        1091,
        1160,
        2095,
        2945],
      woe: [ 1.3104622970058704,
        1.145325947915722,
        1.1445251365264193,
        0.895038806980977,
        -0.20232892645492817,
        -0.35770247405915634,
        -0.44176832996037,
        -1.1993587102237444,
        -1.3944872473671013]
    },
    item12: {
      title : " Outstanding Debt ",
      bin: [ "(-inf, 578.45)",
        "[578.45, 1248.34)",
        "[1248.34, 1500.01)",
        "[1500.01, inf)"],
      non_event: [ 8517,
        9344,
        3967,
        4393],
      event: [
        886,
        1030,
        1504,
        7289],
      woe: [
         1.3676263875211268,
        1.3096995168294532,
        0.07440580898967153,
        -1.4018301044213066]
    },
    item13: {
      title : "  Credit Utilization Ratio ",
      bin: [
       "(-inf, 24.49)",
        "[24.49, 27.34)",
        "[27.34, 30.21)",
        "[30.21, 38.07)",
        "[38.07, 40.03)",
        "[40.03, inf)"],
      non_event: [  
        1462,
        3766,
        4391,
        12352,
        2650,
        1600],
      event: [
        783,
        1648,
        1802,
        5043,
        983,
        450
    ],
      woe: [
        -0.2710481626959528,
        -0.06902510826719266,
        -0.004816274621439187,
        0.0003407431729586241,
        0.09622969181822794,
        0.37303521844863374]
    },
    item14: {
      title : "Credit History Age ",
      bin: [
         "(-inf, 138.50)",
        "[138.50, 183.50)",
        "[183.50, 230.50)",
        "[230.50, 243.50)",
        "[243.50, 314.50)",
        "[314.50, 375.50)",
        "[375.50, inf)"],
      non_event: [
        3963,
        1917,
        7244,
        1376,
        5195,
        4673,
        1853],
      event: [  
        4056,
        1876,
        2825,
        508,
        722,
        526,
        196],
      woe: [ 
        -0.9186720590954577,
        -0.8738564935353988,
        0.04618906840788917,
        0.1009784638999337,
        1.0779506576256281,
        1.2887792229478428,
        1.350970460039969]
    },
    item15: {
      title : " Total EMI per Month ",
      bin: [
       "(-inf, 13.89)",
        "[13.89, 24.84)",
       "[24.84, 41.93)",
      "[41.93, inf)"],
      non_event: [
        4463,
        2027,
        3177,
        16554],
      event: [
        702,
        733,
        1379,
        7895],
      woe: [
         0.9541669535885852,
        0.12169033755047509,
        -0.06089735053865908,
        -0.15507799025927493]
    },
    item16: {
      title : " Amount Invested Monthly ",
      bin: [ 
        "(-inf, 47.97)",
        "[47.97, 86.85)",
        "[86.85, 119.90)",
        "[119.90, 137.55)",
        "[137.55, 153.64)",
        "[153.64, 197.66)",
        "[197.66, 227.88)",
        "[227.88, 378.18)",
        "[378.18, 529.56)",
        "[529.56, inf)"],
      non_event: [ 
        2763,
        4501,
        3498,
        2802,
        1301,
        2721,
        1380,
        3625,
        1582,
        2048],
      event: [  
        1498,
        2330,
        1580,
        1212,
        548,
        1069,
        479,
        1177,
        481,
        335],
      woe: [ 
        -0.2832899461686219,
        -0.23704478028168707,
        -0.10070957745733844,
        -0.05741454674718094,
        -0.030862915450383777,
        0.038799720743327604,
        0.1626620737254617,
        0.22940935301362486,
        0.2951017712069647,
        0.9150123473194586]
    },
    item17: {
      title : " Monthly Balance of Customer   ",
      bin: [
         "(-inf, 275.94)",
        "[275.94, 300.92)",
        "[300.92, 326.48)",
        "[326.48, 338.64)",
        "[338.64, 358.30)",
        "[358.30, 440.76)",
        "[440.76, 566.28)",
        "[566.28, 670.95)",
        "[670.95, inf)"],
      non_event: [  
          6004,
        2392,
        2257,
        1374,
        1398,
        4235,
        3335,
        1657,
        3569],
      event: [   
         4082,
        1425,
        1063,
        510,
        496,
        1336,
        939,
        305,
        553],
      woe: [ 
        -0.5096372576313108,
        -0.3775180846471019,
        -0.14253470853928563,
        0.09559464004904983,
        0.14074588905395446,
        0.2582271459746902,
        0.3719363721265877,
        0.7969761338042779,
        0.969206614952952]
    }
    
    
  };


  const formattedDataArray = convertDataToChartJSFormat(rawData);
  

  return (
    <div className="App">
      {formattedDataArray.map((data, index) => (
        <LineChart key={index} data={data} title={data.title} />
      ))}
    </div>
  );
}

export default App;